IDENTIFICATION DIVISION.
    PROGRAM-ID. HELLO-WORLD.
    AUTHOR. CLAUDIO SCHEER.
    DATE-WRITTEN. 10/16/17.

ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.

DATA DIVISION.
    WORKING-STORAGE SECTION.
    77 WS-VALUE PICTURE X(10).

PROCEDURE DIVISION.
    DISPLAY "Type some value: " WITH NO ADVANCING.
    ACCEPT WS-VALUE FROM CONSOLE.
    DISPLAY "Value: " WS-VALUE. *> Display value.
    STOP RUN.