IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
AUTHOR. CLAUDIO SCHEER.
DATE-WRITTEN. 10/16/17.

PROCEDURE DIVISION.
DISPLAY "Hello world.".
STOP RUN.